{
  "sucess" : true,
  "data": {
    "topicList" : [{
      "id": 1,
      "title": "Best Seller",
      "imgUrl": "icon1.svg"
    },{
      "id": 2,
      "title": "Authors",
      "imgUrl": "icon2.svg"
    },{
      "id": 3,
      "title": "Popular Series",
      "imgUrl": "icon3.svg"
    },{
      "id": 4,
      "title": "Coming Soon",
      "imgUrl": "icon4.svg"
    },{
      "id": 5,
      "title": "Collections",
      "imgUrl": "icon5.svg"
    },{
      "id": 6,
      "title": "New In",
      "imgUrl": "icon6.svg"
    }],

    "articleList" : [{
      "id": 1,
      "title": "Becoming",
      "brief" : "Number one New York Times best seller",
      "content":"Her dance moves. Her vegetable garden. Her advocacy for girls everywhere. Her humility despite being one of the best-known names in the world...",
      "author": "Michelle Obama",
      "imgUrl": "list1.jpg",
      "follow": "72,000",
      "avatar": "avatar7.jpg",
      "details1": "An intimate, powerful, and inspiring memoir by the former first lady of the United States.Number one New York Times best seller Watch the Emmy-nominated Netflix original documentary Oprah’s Book Club Pick NAACP Image Award Winner.One of Essence’s 50 most impactful Black books of the past 50 years. In a life filled with meaning and accomplishment, Michelle Obama has emerged as one of the most iconic and compelling women of our era. As first lady of the United States of America - the first African American to serve in that role - she helped create the most welcoming and inclusive White House in history while also establishing herself as a powerful advocate for women and girls in the US and around the world, dramatically changing the ways that families pursue healthier and more active lives, and standing with her husband as he led America through some of its most harrowing moments. Along the way, she showed us a few dance moves, crushed Carpool Karaoke, and raised two down-to-earth daughters under an unforgiving media glare. In her memoir, a work of deep reflection and mesmerizing storytelling, Michelle Obama invites listeners into her world, chronicling the experiences that have shaped her - from her childhood on the South Side of Chicago to her years as an executive balancing the demands of motherhood and work to her time spent at the world's most famous address. With unerring honesty and lively wit, she describes her triumphs and her disappointments, both public and private, telling her full story as she has lived it - in her own words and on her own terms. Warm, wise, and revelatory, Becoming is the deeply personal reckoning of a woman of soul and substance who has steadily defied expectations - and whose story inspires us to do the same."
      },{
      "id": 2,
      "title": "Rage",
      "brief" : "An unprecedented and intimate tour de force of original reporting on the Trump presidency from Bob Woodward.",
      "content": "Rage goes behind the scenes like never before, with stunning new details about early national security decisions and operations and Trump’s moves as he faces...",
      "author": "Bob Woodward",
      "imgUrl": "list2.jpg",
      "follow": "90,500",
      "avatar": "avatar1.jpg",
      "details1": "Rage goes behind the scenes like never before, with stunning new details about early national security decisions and operations and Trump’s moves as he faces a global pandemic, economic disaster, and racial unrest. Woodward, the number one internationally best-selling author of 13 number-one best sellers, including Fear: Trump in the White House, shows Trump up close in his entirety before the 2020 presidential election. President Trump has said publicly that Woodward has interviewed him. What is not known is that Trump provided Woodward a window into his mind through a series of exclusive interviews. At key decision points, Rage shows how Trump’s responses to the crises of 2020 were rooted in the instincts, habits, and style he developed during his first three years as president. Rage draws from hundreds of hours of interviews with firsthand witnesses, as well as participants’ notes, emails, diaries, calendars, and confidential documents. Woodward obtained 25 personal letters exchanged between Trump and North Korean leader Kim Jong Un that have not been public before. Kim describes the bond between the two leaders as out of a “fantasy film”, as the two leaders engage in an extraordinary diplomatic minuet. Rage will be the foundational account of the Trump presidency, its turmoil, contradictions, and risks. It is an essential document for any voter seeking an accurate inside view of the Trump years - volatile and vivid."
    },{
      "id": 3,
      "brief" : "Nina can never forgive Maggie for what she did. And she can never let her leave.",
      "title": "What Lies Between Us",
      "content":"They say every house has its secrets, and the house that Maggie and Nina have shared for so long is no different. Except that these secrets are not buried in the past...",
      "author": "John Marrs",
      "imgUrl": "list3.jpg",
      "follow": "10,890",
      "avatar": "avatar2.jpg",
      "details1": "They say every house has its secrets, and the house that Maggie and Nina have shared for so long is no different. Except that these secrets are not buried in the past. Every other night, Maggie and Nina have dinner together. When they are finished, Nina helps Maggie back to her room in the attic, and into the heavy chain that keeps her there. Because Maggie has done things to Nina that can’t ever be forgiven, and now she is paying the price. But there are many things about the past that Nina doesn’t know, and Maggie is going to keep it that way - even if it kills her.Because in this house, the truth is more dangerous than lies."
    },{
      "id": 4,
      "title": "Dune",
      "brief" : "Soon to be a major motion picture directed by Denis Villeneuve, starring Timothée Chalamet, Josh Brolin, Jason Momoa, Zendaya, Rebecca Ferguson, Oscar Isaac, Javier Bardem, Dave Bautista, Stellan Skarsgård, and Charlotte Rampling.",
      "content":"Soon to be a major motion picture directed by Denis Villeneuve, starring Timothée Chalamet, Josh Brolin, Jason Momoa, Zendaya, Rebecca Ferguson, Oscar Isaac, Javier Bardem, Dave Bautista, Stellan Skarsgård, and Charlotte Rampling...",
      "author": "Frank Herbert",
      "imgUrl": "list4.jpg",
      "follow": "9,500",
      "avatar": "avatar3.jpg",
      "details1": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, who would become the mysterious man known as Maud'dib. He would avenge the traitorous plot against his noble family - and would bring to fruition humankind's most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction. Frank Herbert's death in 1986 was a tragic loss, yet the astounding legacy of his visionary fiction will live forever."
    },{
      "id": 5,
      "title": "Blackout",
      "brief" : "How Black America Can Make Its Second Escape from the Democrat Plantation",
      "content":"How Black America Can Make Its Second Escape from the Democrat Plantation...",
      "author": "Candace Owens",
      "imgUrl": "list5.jpg",
      "follow": "40,440",
      "avatar": "avatar4.jpg",
      "details1":"It’s time for a black exit. Political activist and social media star Candace Owens addresses the many ways that Democrat Party policies hurt, rather than help, the African American community, and why she and many others are turning right.Black Americans have long been shackled to the Democrats. Seeing no viable alternative, they have watched liberal politicians take the black vote for granted without pledging anything in return. In Blackout, Owens argues that this automatic allegiance is both illogical and unearned. She contends that the Democrat Party has a long history of racism and exposes the ideals that hinder the Black community’s ability to rise above poverty, live independent and successful lives, and be an active part of the American dream. Instead, Owens offers up a different ideology by issuing a challenge: It’s time for a major Black exodus. From dependency, from victimhood, from miseducation - and the Democrat Party, which perpetuates all three. Owens explains that government assistance is a double-edged sword, that the Left dismisses the faith so important to the Black community, that Democrat permissiveness toward abortion disproportionately affects Black babies, that the #MeToo movement hurts Black men, and much more. Weaving in her personal story, which ushered her from a roach-infested low-income apartment to 1600 Pennsylvania Avenue, she demonstrates how she overcame her setbacks and challenges despite the cultural expectation that she should embrace a victim mentality. Well-researched and intelligently argued, Blackout lays bare the myth that all Black people should vote Democrat - and shows why turning to the right will leave them happier, more successful, and more self-sufficient."
    },{
      "id": 6,
      "title": "Disloyal: A Memoir",
      "brief" : "The True Story of the Former Personal Attorney to President Donald J. Trump",
      "content":"The inside story of the real President Trump, by his former attorney and personal advisor - the man who helped get him into the oval office...",
      "author": "Michael Cohen",
      "imgUrl": "list6.jpg",
      "follow": "10,500",
      "avatar": "avatar5.jpg",
      "details1": "Once Donald Trump’s fiercest surrogate, closest confidant, and staunchest defender, Michael Cohen knows where the skeletons are buried.This is the most devastating business and political horror story of the century. As Trump’s lawyer and “fixer”, Cohen not only witnessed firsthand but was also an active participant in the inner workings of Trump’s business empire, political campaign, and presidential administration. This is a story that you have not read in newspapers, or on social media, or watched on television. These are accounts that only someone who worked for Trump around the clock for over a decade - not a few months or even a couple of years - could know. Cohen describes Trump’s racist rants against President Barack Obama, Nelson Mandela, and Black and Hispanic people in general, as well as the cruelty, humiliation, and abuse he leveled at family and staff. Whether he’s exposing the fact that Trump engaged in tax fraud by inflating his wealth or electronic fraud by rigging an online survey, or outing Trump’s Neanderthal views towards women or his hush-money payments to clandestine lovers, Cohen pulls no punches. He shows Trump’s relentless willingness to lie, exaggerate, mislead, or manipulate. Trump emerges as a man without a soul - a man who courts evangelicals and then trashes them, panders to the common man, but then rips off small business owners, a con man who will do or say absolutely anything to win, regardless of the cost to his family, his associates, or his country. At the heart of Disloyal, we see how Cohen came under the spell of his charismatic 'Boss' and, as a result, lost all sense of his moral compass. The real 'real' Donald Trump who permeates this audiobook - the racist, sexist, homophobic, lying, cheating president - will be discussed, written about, and analyzed for years to come."
    }],  
    "writerList":[{
      "id":1,
      "name":"James Patterson",
      "bookNum": 28,
      "likes": "415k",
      "imgUrl": "avatar1.jpg",
      "follow": "71,020"
    },{
      "id":2,
      "name": "Jason Reynolds",
      "bookNum": 20,
      "likes": "407k",
      "imgUrl": "avatar2.jpg",
      "follow": "5,500"
    },{
      "id":3,
      "name": "Rachel Hollis",
      "bookNum": 5,
      "likes": "389k",
      "imgUrl": "avatar3.jpg",
      "follow": "5,490"
    },{
      "id":4,
      "name": "Celeste Ng",
      "bookNum": 3,
      "likes": "351k",
      "imgUrl": "avatar4.jpg",
      "follow": "9,300"
    },{
      "id":5,
      "name": "Danielle Steel",
      "bookNum": 21,
      "likes": "320k",
      "imgUrl": "avatar5.jpg",
      "follow": "6,700"
    },{
      "id":6,
      "name": "J. K. Rowling",
      "bookNum": 87,
      "likes": "311k",
      "imgUrl": "avatar6.jpg",
      "follow": "8,790"
    },{
      "id": 7,
      "name": "Jackie Collins",
      "likes": "72k",
      "imgUrl": "avatar7.jpg",
      "bookNum": 8
  },{
      "id": 8,
      "name": "Dean Koontz",
      "likes": "115k",
      "imgUrl": "avatar8.jpg",
      "bookNum": 11
  },{
      "id": 9,
      "name": "James A. Michener",
      "likes": "97k",
      "imgUrl": "avatar9.jpg",
      "bookNum": 12
  },{
      "id": 10,
      "name": "Isabel Allende",
      "likes": "109k",
      "imgUrl": "avatar10.jpg",
      "bookNum": 28
  },{
      "id": 11,
      "name": "John Jakes",
      "likes": "121k",
      "imgUrl": "avatar11.jpg",
      "bookNum": 4
  },{
      "id": 12,
      "name": "William Shakespeare",
      "likes": "85k",
      "imgUrl": "avatar12.jpg",
      "bookNum": 5
    }]
  }
}


